; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_1 type_3)
 (:predicates (pred_4 ?v6 - type_1 ?v4 - type_2)
 	      (pred_3 ?v8 - object ?v4 - type_2)
	      (pred_1 ?v6 - type_1 ?v2 - type_3)
	      (pred_2 ?v6 - type_1 ?v8 - object ?v2 - type_3))

   (:action op_2
       :parameters  (?v6 - type_1 ?v7 ?v1 - type_2)
       :precondition (and  (pred_4 ?v6 ?v7))
       :effect (and  (pred_4 ?v6 ?v1)
		     (not (pred_4 ?v6 ?v7))))

   (:action op_3
       :parameters (?v6 - type_1 ?v5 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_3 ?v5 ?v3) (pred_4 ?v6 ?v3) (pred_1 ?v6 ?v2))
       :effect (and (pred_2 ?v6 ?v5 ?v2)
		    (not (pred_3 ?v5 ?v3)) 
		    (not (pred_1 ?v6 ?v2))))

   (:action op_1
       :parameters (?v6 - type_1 ?v5 - object ?v3 - type_2 ?v2 - type_3)
       :precondition  (and  (pred_2 ?v6 ?v5 ?v2) (pred_4 ?v6 ?v3))
       :effect (and (pred_3 ?v5 ?v3)
		    (pred_1 ?v6 ?v2)
		    (not (pred_2 ?v6 ?v5 ?v2)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_12 obj_01 - type_1
obj_10 obj_02 obj_03 obj_13 - type_3
obj_06 obj_05 obj_11 obj_09 - type_2
obj_07 obj_08 obj_04 - object)
(:init
(pred_4 obj_12 obj_05)
(pred_1 obj_12 obj_10)
(pred_1 obj_12 obj_02)
(pred_4 obj_01 obj_11)
(pred_1 obj_01 obj_03)
(pred_1 obj_01 obj_13)
(pred_3 obj_07 obj_09)
(pred_3 obj_08 obj_06)
(pred_3 obj_04 obj_09)
)
(:goal
(and
(pred_3 obj_07 obj_06)
(pred_3 obj_08 obj_11)
(pred_3 obj_04 obj_11)
)
)

(:constraints
  (always (not (pred_4 obj_12 obj_11)))
)
)

; plan
1. (op_2 obj_12 obj_05 obj_06)
   deleted: (pred_4 obj_12 obj_05)
   added: (pred_4 obj_12 obj_06)
   goals met: 0 of 3
2. (op_2 obj_01 obj_11 obj_06)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_06)
   goals met: 0 of 3
3. (op_3 obj_12 obj_08 obj_06 obj_02)
   deleted: (pred_3 obj_08 obj_06) (pred_1 obj_12 obj_02)
   added: (pred_2 obj_12 obj_08 obj_02)
   goals met: 0 of 3
4. (op_2 obj_01 obj_06 obj_05)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_05)
   goals met: 0 of 3
5. (op_2 obj_12 obj_06 obj_09)
   deleted: (pred_4 obj_12 obj_06)
   added: (pred_4 obj_12 obj_09)
   goals met: 0 of 3
6. (op_2 obj_01 obj_05 obj_09)
   deleted: (pred_4 obj_01 obj_05)
   added: (pred_4 obj_01 obj_09)
   goals met: 0 of 3
7. (op_3 obj_12 obj_04 obj_09 obj_10)
   deleted: (pred_3 obj_04 obj_09) (pred_1 obj_12 obj_10)
   added: (pred_2 obj_12 obj_04 obj_10)
   goals met: 0 of 3
8. (op_3 obj_01 obj_07 obj_09 obj_13)
   deleted: (pred_3 obj_07 obj_09) (pred_1 obj_01 obj_13)
   added: (pred_2 obj_01 obj_07 obj_13)
   goals met: 0 of 3
9. (op_2 obj_01 obj_09 obj_06)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_06)
   goals met: 0 of 3
10. (op_1 obj_12 obj_04 obj_09 obj_10)
   deleted: (pred_2 obj_12 obj_04 obj_10)
   added: (pred_3 obj_04 obj_09) (pred_1 obj_12 obj_10)
   goals met: 0 of 3
11. (op_1 obj_01 obj_07 obj_06 obj_13)
   deleted: (pred_2 obj_01 obj_07 obj_13)
   added: (pred_3 obj_07 obj_06) (pred_1 obj_01 obj_13)
   goals met: 1 of 3
12. (op_2 obj_01 obj_06 obj_09)
   deleted: (pred_4 obj_01 obj_06)
   added: (pred_4 obj_01 obj_09)
   goals met: 1 of 3
13. (op_1 obj_12 obj_08 obj_09 obj_02)
   deleted: (pred_2 obj_12 obj_08 obj_02)
   added: (pred_3 obj_08 obj_09) (pred_1 obj_12 obj_02)
   goals met: 1 of 3
14. (op_3 obj_01 obj_08 obj_09 obj_13)
   deleted: (pred_3 obj_08 obj_09) (pred_1 obj_01 obj_13)
   added: (pred_2 obj_01 obj_08 obj_13)
   goals met: 1 of 3
15. (op_2 obj_01 obj_09 obj_11)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_11)
   goals met: 1 of 3
16. (op_1 obj_01 obj_08 obj_11 obj_13)
   deleted: (pred_2 obj_01 obj_08 obj_13)
   added: (pred_3 obj_08 obj_11) (pred_1 obj_01 obj_13)
   goals met: 2 of 3
17. (op_2 obj_01 obj_11 obj_09)
   deleted: (pred_4 obj_01 obj_11)
   added: (pred_4 obj_01 obj_09)
   goals met: 2 of 3
18. (op_3 obj_01 obj_04 obj_09 obj_13)
   deleted: (pred_3 obj_04 obj_09) (pred_1 obj_01 obj_13)
   added: (pred_2 obj_01 obj_04 obj_13)
   goals met: 2 of 3
19. (op_2 obj_01 obj_09 obj_11)
   deleted: (pred_4 obj_01 obj_09)
   added: (pred_4 obj_01 obj_11)
   goals met: 2 of 3
20. (op_1 obj_01 obj_04 obj_11 obj_13)
   deleted: (pred_2 obj_01 obj_04 obj_13)
   added: (pred_3 obj_04 obj_11) (pred_1 obj_01 obj_13)
   goals met: 3 of 3
